# We keep this here as well as in the installation script
# So that we can later use this file for 'brew bundle cleanup'
tap 'homebrew/bundle'

# specify a directory to install
#$cask_args appdir: '/Applications'

# General setup
brew 'autojump'
brew 'coreutils' # In case the ones existing is outdated.
brew 'git'
brew 'htop'
brew 'jq'
brew 'nvm'
brew 'node'
brew 'python'
brew 'zsh'
brew 'zsh-autocomplete'
brew 'zsh-syntax-highlighting'
brew 'powerlevel10k'
brew 'antigen'


# Apps
cask 'iterm2'
cask 'slack'
cask 'notion'
cask '1password'
cask 'signal'
cask 'warp'
cask 'rectangle'
cask 'zen'

# Dotnet
cask 'dotnet-sdk'
cask 'rider'
brew 'azure-cli'
brew 'docker'
